Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр StockInventory
	Движения.StockInventory.Записывать = Истина;
	Для Каждого CurRowItemList из ItemList Цикл
		Движение = Движения.StockInventory.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Item = CurRowItemList.Item;
		Движение.Quantity = CurRowItemList.Quantity;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	TotalSum = ItemList.Итог("Sum")
	
КонецПроцедуры
