#Область ОбработчикиСобытийЭлементовТаблицыФормыItemList

&НаКлиенте
Процедура ItemListПриИзменении(Элемент)
	
	Объект.TotalSum = Объект.ItemList.Итог("Sum");
	
КонецПроцедуры

&НаКлиенте
Процедура ItemListQuantityПриИзменении(Элемент)
	
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	ОбщегоНазначенияКлиент.РассчитатьСуммуВСтроке(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ItemListPriceПриИзменении(Элемент)
	
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;
	ОбщегоНазначенияКлиент.РассчитатьСуммуВСтроке(ТекСтрока);
	
КонецПроцедуры

#КонецОбласти